05_DFSEM/base_case/system/probes1H
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;

fields
(
    U
);

probeLocations
(
(1.25 1.5 0.45)
(1.25 1.45 0.45)
(1.25 1.4 0.45)
(1.25 1.35 0.45)
(1.25 1.3 0.45)
(1.25 1.25 0.45)
(1.25 1.2 0.45)
(1.25 1.15 0.45)
(1.25 1.1 0.45)
(1.25 1.05 0.45)
(1.25 1 0.45)
(1.25 0.95 0.45)
(1.25 0.9 0.45)
(1.25 0.85 0.45)
(1.25 0.8 0.45)
(1.25 0.75 0.45)
(1.25 0.7 0.45)
(1.25 0.65 0.45)
(1.25 0.6 0.45)
(1.25 0.55 0.45)
(1.25 0.5 0.45)
(1.25 0.45 0.45)
(1.25 0.4 0.45)
(1.25 0.35 0.45)
(1.25 0.3 0.45)
(1.25 0.25 0.45)
(1.25 0.2 0.45)
(1.25 0.15 0.45)
(1.25 0.1 0.45)
(1.25 0.05 0.45)
(1.25 0 0.45)

);

// ************************************************************************* //
